const Map<String , String> ar = {

  'حدد اللغة':'حدد اللغة',
  'الصفحة الرئيسية':'الصفحة الرئيسية',
  'تسوق حسب الفئة':'تسوق حسب الفئة',
  'عرض الكل':'عرض الكل',
  'متاجراخترناها لك':'متاجراخترناها لك',
  'متاجر جديدة':'متاجر جديدة',
  'للأطفال':'للأطفال',
  'للسيدات':'للسيدات',
  'للرجال':'للرجال',
  'اكسسوارات':'اكسسوارات',
  'هدايا':'هدايا',
  'ماكولات':'ماكولات',
  'ملابس':'ملابس',
  'أحذية':'أحذية',
  'عطور':'عطور',
  'فنون':'فنون',
  'الرئيسية':'الرئيسية',
  'الى المتاجر':'الى المتاجر',
  'معلومات المستخدم':'معلومات المستخدم',
  'حسابي':'حسابي',
  'منتجات أعجبتني':'منتجات أعجبتني',
  'منتجات طلبتها':'منتجات طلبتها',
  'منتجات شاهدتها':'منتجات شاهدتها',
  'تسجيل خروج':'تسجيل خروج',
  'التطبيق':'التطبيق',
  'اللغة':'اللغة',
  'للانضمام الى متجراتي':'للانضمام الى متجراتي',
  'عن متجراتي':'عن متجراتي',
  'ضبط':'ضبط',
  'سياسة الخصوصية':'سياسة الخصوصية',
  'قيم هذا التطبيق':'قيم هذا التطبيق',
  'متجراتي':'متجراتي'




};