const Map<String, String> ar = {
  'حدد اللغة': 'حدد اللغة',
  'الصفحة الرئيسية': 'الصفحة الرئيسية',
  'تسوق حسب الفئة': 'تسوق حسب الفئة',
  'عرض الكل': 'عرض الكل',
  'متاجراخترناها لك': 'متاجراخترناها لك',
  'متاجر جديدة': 'متاجر جديدة',
  'للأطفال': 'للأطفال',
  'للسيدات': 'للسيدات',
  'للرجال': 'للرجال',
  'اكسسوارات': 'اكسسوارات',
  'هدايا': 'هدايا',
  'ماكولات': 'ماكولات',
  'ملابس': 'ملابس',
  'أحذية': 'أحذية',
  'عطور': 'عطور',
  'فنون': 'فنون',
  'الرئيسية': 'الرئيسية',
  'الى المتاجر': 'الى المتاجر',
  'معلومات المستخدم': 'معلومات المستخدم',
  'حسابي': 'حسابي',
  'منتجات أعجبتني': 'منتجات أعجبتني',
  'منتجات طلبتها': 'منتجات طلبتها',
  'منتجات شاهدتها': 'منتجات شاهدتها',
  'تسجيل خروج': 'تسجيل خروج',
  'التطبيق': 'التطبيق',
  'اللغة': 'اللغة',
  'للانضمام الى متجراتي': 'للانضمام الى متجراتي',
  'عن متجراتي': 'عن متجراتي',
  'ضبط': 'ضبط',
  'سياسة الخصوصية': 'سياسة الخصوصية',
  'قيم هذا التطبيق': 'قيم هذا التطبيق',
  'متجراتي': 'متجراتي',
  'الاشعارات': 'الاشعارات',
  'انشاء متجر': 'انشاء متجر',
  'انارة': 'انارة',
  'الكترونيك': 'الكترونيك',
  'الكل':'الكل',
  'هاتف':'هاتف',
  'زيارة موقعنا':'زيارة موقعنا',
  'فيسبوك':'فيسبوك',
  'سناب شات':'سناب شات',
  'واتس أب':'واتس أب',
  'انستغرام':'انستغرام',
  'عنوان المتجر':'عنوان المتجر',
  'عن المتجر':'عن المتجر',
  'المنتجات':'المنتجات',
  'اكتب اسم المنتج ...':'اكتب اسم المنتج ...',
  'موافق':'موافق',
  'تمت اضافته الى السلة ':'تمت اضافته الى السلة ',
  'اغلاق':'اغلاق',
  'السعر : ':'السعر : ',
  'السلة':'السلة',
  'مجموع السعر : ':'مجموع السعر : ',
  'استعمال':'استعمال',
  'استكمال الطلب':'استكمال الطلب',
  'تمت ازالته من السلة ':'تمت ازالته من السلة ',
  'تم استعمال كود الخصم':'تم استعمال كود الخصم',
  'Points have been used':'Points have been used',
  'يجب ان يكون لديك على الاقل 50 نقطة , نقاطك لا تكفي ':'يجب ان يكون لديك على الاقل 50 نقطة , نقاطك لا تكفي ',
  'يجب ان تستعمل 50 او 100 او 150 نقاط لاكمال هذه العملية ':'يجب ان تستعمل 50 او 100 او 150 نقاط لاكمال هذه العملية ',

  'البحث':'البحث',
  'اسم المنتج':'اسم المنتج',
  'الاسم':'الاسم',
  'السعر':'السعر',
  'أقل سعر':'أقل سعر',
  'أعلى سعر':'أعلى سعر',
  'رتب حسب السعر':'رتب حسب السعر' ,
  'بحث':'بحث',
  'تصاعدي':'تصاعدي',
  'تنازلي':'تنازلي',
  'شراء الان':'شراء الان',
  'للأطفال - ':'للأطفال - ',
  'نابلس':'نابلس',
  'القدس':'القدس',
  'للسيدات - ':'للسيدات - ',
  'للرجال - ':'للرجال - ',
  'اكسسوارات - ':'اكسسوارات - ',
  'انارة - ':'انارة - ',
  'ماكولات - ':'ماكولات - ',
  'ملابس - ':'ملابس - ',
  'أحذية - ':'أحذية - ',
  'عطور - ':'عطور - ',
  'الكترونيك - ':'الكترونيك - ',
  'اسم المستخدم':'اسم المستخدم',
  'الرجاء ادخال اسم المستخدم':'الرجاء ادخال اسم المستخدم',
  'البريد الالكتروني':'البريد الالكتروني',
  'الرجاء ادخال البريد الالكتروني':'الرجاء ادخال البريد الالكتروني',
  'تعديل':'تعديل',
  'تغيير كلمة السر':'تغيير كلمة السر',
  'كلمة المرور':'كلمة المرور',
  'الرجاء ادخال كلمة المرور':'الرجاء ادخال كلمة المرور',
  'تاكيد كلمة المرور':'تاكيد كلمة المرور',

  'رقم الطلب : ':'رقم الطلب : ',
  'صورة المنتج : ':'صورة المنتج : ',
  'اسم المتجر : ':'اسم المتجر : ',
  'اسم المنتج : ':'اسم المنتج : ',
  'المبلغ الاجمالي : ':'المبلغ الاجمالي : ',
  'الحجم : ':'الحجم : ',
  'حالة الطلب : ':'حالة الطلب : ',
  'معلومات الاتصال':'معلومات الاتصال',
  'الرجاء ادخال رقم الهاتف':'الرجاء ادخال رقم الهاتف',
    'المدينة':'المدينة',
  'الحجم':'الحجم',
  'حدد الحجم ان لزم او اتركه فارغ \" .... \" ':'حدد الحجم ان لزم او اتركه فارغ \" .... \" ',
  'العنوان':'العنوان',
  'حدد مكانك بالتفصيل':'حدد مكانك بالتفصيل',
  'ارسال':'ارسال',
  'تم اتمام طلبك بنجاح':'تم اتمام طلبك بنجاح',
  'الهاتف':'الهاتف',
  'تسجيل الدخول':'تسجيل الدخول',
  'هل نسيت كلمة المرور؟':'هل نسيت كلمة المرور؟',
  'جديد هنا؟ سجل الان!':'جديد هنا؟ سجل الان!',

  'كلمة السر':'كلمة السر',
  'عضو بالفعل؟ سجل الدخول!':'عضو بالفعل؟ سجل الدخول!',

  'انشاء حساب':'انشاء حساب',
  'الصورة الشخصية':'الصورة الشخصية',

  'حدد اهتماماتك : ':'حدد اهتماماتك : ',
  'هل تريد انشاء متجر ؟ انشأه الان!':'هل تريد انشاء متجر ؟ انشأه الان!',

  'صورة المتجر':'صورة المتجر',
  'اختر صورة من المعرض':'اختر صورة من المعرض',
  'اسم المتجر':'اسم المتجر',
  'وصف بسيط عن المتجر':'وصف بسيط عن المتجر',
  'قم بوصف متجرك ':'قم بوصف متجرك ',
  'اختر الفئة':'اختر الفئة',
  'اختر المدينة':'اختر المدينة',
  'رابط فيسبوك':'رابط فيسبوك',
  'رابط انستغرام':'رابط انستغرام',
  'رابط سناب شات':'رابط سناب شات',
  'رابط الخريطة':'رابط الخريطة',
  'رقم واتس اب':'رقم واتس اب',
  'انشاء':'انشاء',
  'سوف تصلك رسالة قريبا بان تم قبول متجرك ام لا ':'سوف تصلك رسالة قريبا بان تم قبول متجرك ام لا ',
  'هل نسيت كلمة المرور !':'هل نسيت كلمة المرور !',

  'الى الرئيسية':'الى الرئيسية',
  'طلبات المتاجر الجديدة':'طلبات المتاجر الجديدة',

  'ارسال اشعارات':'ارسال اشعارات',
  'جميع المتاجر':'جميع المتاجر',
  'الطلبات':'الطلبات',
  'المالية':'المالية',
  'الاحصائيات':'الاحصائيات',
  'التنبيهات':'التنبيهات',
  'خروج':'خروج',
  'تم تعديل البيانات بنجاح':'تم تعديل البيانات بنجاح',

  'المتاجر':'المتاجر',
  'وصف المتجر : ':'وصف المتجر : ',

  'تفاصيل المتجر':'تفاصيل المتجر',
  'عنوان المتجر : ' :'عنوان المتجر : ',


  'الفئة المختارة :':'الفئة المختارة :',
  'رقم الهاتف المحمول : ':'رقم الهاتف المحمول : ',

  'المدينة : ':'المدينة : ',
  'قبول':'قبول',
  'رفض':'رفض',
  'تم قبول هذا المتجر':'تم قبول هذا المتجر',

  'تم رفض هذا المتجر':'تم رفض هذا المتجر',


'رابط الفيسبوك : ':'رابط الفيسبوك : ',
'رابط الانستاغرام : ':'رابط الانستاغرام : ',
'رابط السناب شات : ':'رابط السناب شات : ',
'رابط الخريطة : ':'رابط الخريطة : ',
'رقم الواتس اب : ':'رقم الواتس اب : ',
  'طلبات المتاجر':'طلبات المتاجر',
  'تم حذف المتجر !! ':'تم حذف المتجر !! ',
  'حذف المتجر':'حذف المتجر',

  'ارسال تنبيه':'ارسال تنبيه',
  'اضف صورة للاشعار':'اضف صورة للاشعار',

  'عنوان الاشعار':'عنوان الاشعار',

  'وصف الاشعار':'وصف الاشعار',


  'قم بوصف الاشعار':'قم بوصف الاشعار',


  'تم ارسال اشعار للمستخدمين':'تم ارسال اشعار للمستخدمين',
'الرجاء ادخال جميع الحقول':'الرجاء ادخال جميع الحقول',

'حجم الصورة تجاوز الحد المسموح':'حجم الصورة تجاوز الحد المسموح',





//  Shopkeeper Pages

  'متجري':'متجري',
  'منتجاتي':'منتجاتي',
  'اضافة منتج جديد':'اضافة منتج جديد',
  'الطلبات الجديدة': 'الطلبات الجديدة',
  'طلبات قيد التوصيل':'طلبات قيد التوصيل',
  'جميع الطلبات':'جميع الطلبات',
  'بروفايلي':'بروفايلي',
  'ارسال الاشعارات':'ارسال الاشعارات',
  'تسجيل الخروج':'تسجيل الخروج',
  'تعديل الملف الشخصي':'تعديل الملف الشخصي',

'تم تعديل الملف الشخصي بنجاح':'تم تعديل الملف الشخصي بنجاح',
'المدينة المختارة':'المدينة المختارة',
'الفئة المختارة':'الفئة المختارة',
'تعديل الصورة':'تعديل الصورة',

//Admin pages
  'من نحن !':'من نحن !',
  'تعديل المعلومات':'تعديل المعلومات',
  'تواصل معنا':'تواصل معنا',
  '- خصومات وعروض لا تفوتك \n- يضم عروض العديد من المتاجر في مختلف المجالات \n- فئات متنوعة تناسب احتاجاتك \n- سهولة في الطلب وسرعة في التوصيل. \n- افضل العروض في كافة مناطق فلسطين':'- خصومات وعروض لا تفوتك \n- يضم عروض العديد من المتاجر في مختلف المجالات \n- فئات متنوعة تناسب احتاجاتك \n- سهولة في الطلب وسرعة في التوصيل. \n- افضل العروض في كافة مناطق فلسطين',
  'ما يميزنا !':'ما يميزنا !',
  'كل ما يهمك تجده في تطبيقنا حيث ستجد باقة من المتاجر في تطبيق واحد. \n يتميز تطبيقنا بسهولة التسوق والبحث عن العروض والخصومات الخاصة بالمتاجر المفضلة لديك. يمكنك من خلال تصفح متاجرنا شراء ما تحتاجه بكبسه واحده يصلك طلبك إلى باب بيتك حيثما كنت في أنحاء فلسطين والدفع يتم عند استلامك لطلبك. \n هيا ماذا تنتظر سارع للانضمام إلى تطبيقنا وشاهد كل ما يحلو لك من المنتجات و البضائع والعروض والخصومات الهائلة والسرعه في الاستجابة. \n نسعى دومًا لمساعدتك في تحصيل العروض التي تبهرك!':'كل ما يهمك تجده في تطبيقنا حيث ستجد باقة من المتاجر في تطبيق واحد. \n يتميز تطبيقنا بسهولة التسوق والبحث عن العروض والخصومات الخاصة بالمتاجر المفضلة لديك. يمكنك من خلال تصفح متاجرنا شراء ما تحتاجه بكبسه واحده يصلك طلبك إلى باب بيتك حيثما كنت في أنحاء فلسطين والدفع يتم عند استلامك لطلبك. \n هيا ماذا تنتظر سارع للانضمام إلى تطبيقنا وشاهد كل ما يحلو لك من المنتجات و البضائع والعروض والخصومات الهائلة والسرعه في الاستجابة. \n نسعى دومًا لمساعدتك في تحصيل العروض التي تبهرك!',

  'عن متجراتي !':'عن متجراتي !',
  'اهلا بك في تطبيقنا التطبيق الأول من نوعه في فلسطين في مجال الاون لاين. حيث يضم مجموعة متميزة من المتاجر الفلسطينية في مختلف المجالات الجمال و الصحة و الالبسة و الالكترونيات و الاطعمة وغيرها الكثير والكثير':'اهلا بك في تطبيقنا التطبيق الأول من نوعه في فلسطين في مجال الاون لاين. حيث يضم مجموعة متميزة من المتاجر الفلسطينية في مختلف المجالات الجمال و الصحة و الالبسة و الالكترونيات و الاطعمة وغيرها الكثير والكثير',

'تعديل صفحة التعريف':'تعديل صفحة التعريف',








































































};
