const Map<String, String> ar = {
  'حدد اللغة': 'حدد اللغة',
  'الصفحة الرئيسية': 'الصفحة الرئيسية',
  'تسوق حسب الفئة': 'تسوق حسب الفئة',
  'عرض الكل': 'عرض الكل',
  'متاجراخترناها لك': 'متاجراخترناها لك',
  'متاجر جديدة': 'متاجر جديدة',
  'للأطفال': 'للأطفال',
  'للسيدات': 'للسيدات',
  'للرجال': 'للرجال',
  'اكسسوارات': 'اكسسوارات',
  'هدايا': 'هدايا',
  'ماكولات': 'ماكولات',
  'ملابس': 'ملابس',
  'أحذية': 'أحذية',
  'عطور': 'عطور',
  'فنون': 'فنون',
  'الرئيسية': 'الرئيسية',
  'الى المتاجر': 'الى المتاجر',
  'معلومات المستخدم': 'معلومات المستخدم',
  'حسابي': 'حسابي',
  'منتجات أعجبتني': 'منتجات أعجبتني',
  'منتجات طلبتها': 'منتجات طلبتها',
  'منتجات شاهدتها': 'منتجات شاهدتها',
  'تسجيل خروج': 'تسجيل خروج',
  'التطبيق': 'التطبيق',
  'اللغة': 'اللغة',
  'للانضمام الى متجراتي': 'للانضمام الى متجراتي',
  'عن متجراتي': 'عن متجراتي',
  'ضبط': 'ضبط',
  'سياسة الخصوصية': 'سياسة الخصوصية',
  'قيم هذا التطبيق': 'قيم هذا التطبيق',
  'متجراتي': 'متجراتي',
  'الاشعارات': 'الاشعارات',
  'انشاء متجر': 'انشاء متجر',
  'انارة': 'انارة',
  'الكترونيك': 'الكترونيك',
  'الكل':'الكل',
  'هاتف':'هاتف',
  'زيارة موقعنا':'زيارة موقعنا',
  'فيسبوك':'فيسبوك',
  'سناب شات':'سناب شات',
  'واتس أب':'واتس أب',
  'انستغرام':'انستغرام',
  'عنوان المتجر':'عنوان المتجر',
  'عن المتجر':'عن المتجر',
  'المنتجات':'المنتجات',
  'اكتب اسم المنتج ...':'اكتب اسم المنتج ...',
  'موافق':'موافق',
  'تمت اضافته الى السلة ':'تمت اضافته الى السلة ',
  'اغلاق':'اغلاق',
  'السعر : ':'السعر : ',
  'السلة':'السلة',
  'مجموع السعر : ':'مجموع السعر : ',
  'استعمال':'استعمال',
  'استكمال الطلب':'استكمال الطلب',
  'تمت ازالته من السلة ':'تمت ازالته من السلة ',
  'تم استعمال كود الخصم':'تم استعمال كود الخصم',
  'Points have been used':'Points have been used',
  'يجب ان يكون لديك على الاقل 50 نقطة , نقاطك لا تكفي ':'يجب ان يكون لديك على الاقل 50 نقطة , نقاطك لا تكفي ',
  'يجب ان تستعمل 50 او 100 او 150 نقاط لاكمال هذه العملية ':'يجب ان تستعمل 50 او 100 او 150 نقاط لاكمال هذه العملية ',

  'البحث':'البحث',
  'اسم المنتج':'اسم المنتج',
  'الاسم':'الاسم',
  'السعر':'السعر',
  'أقل سعر':'أقل سعر',
  'أعلى سعر':'أعلى سعر',
  'رتب حسب السعر':'رتب حسب السعر' ,
  'بحث':'بحث',
  'تصاعدي':'تصاعدي',
  'تنازلي':'تنازلي',
  'شراء الان':'شراء الان',
  'للأطفال - ':'للأطفال - ',
  'نابلس':'نابلس',
  'القدس':'القدس',
  'للسيدات - ':'للسيدات - ',
  'للرجال - ':'للرجال - ',
  'اكسسوارات - ':'اكسسوارات - ',
  'انارة - ':'انارة - ',
  'ماكولات - ':'ماكولات - ',
  'ملابس - ':'ملابس - ',
  'أحذية - ':'أحذية - ',
  'عطور - ':'عطور - ',
  'الكترونيك - ':'الكترونيك - ',
  'اسم المستخدم':'اسم المستخدم',
  'الرجاء ادخال اسم المستخدم':'الرجاء ادخال اسم المستخدم',
  'البريد الالكتروني':'البريد الالكتروني',
  'الرجاء ادخال البريد الالكتروني':'الرجاء ادخال البريد الالكتروني',
  'تعديل':'تعديل',
  'تغيير كلمة السر':'تغيير كلمة السر',
  'كلمة المرور':'كلمة المرور',
  'الرجاء ادخال كلمة المرور':'الرجاء ادخال كلمة المرور',
  'تاكيد كلمة المرور':'تاكيد كلمة المرور',

  'رقم الطلب : ':'رقم الطلب : ',
  'صورة المنتج : ':'صورة المنتج : ',
  'اسم المتجر : ':'اسم المتجر : ',
  'اسم المنتج : ':'اسم المنتج : ',
  'المبلغ الاجمالي : ':'المبلغ الاجمالي : ',
  'الحجم : ':'الحجم : ',
  'حالة الطلب : ':'حالة الطلب : ',




























};
